var qisc1=[41, 2, 1, 6,3];
var qisc2=[41, 3, 3, 7,16];
var qisc3=[2, 0, 1, 1,3];
var qisc4=[6, 1, 2, 0,15];
var qisc5=[10, 1, 0, 1,2];
var qisc6=[4, 0, 2, 0,1];
var qisc7= [8, 3, 0, 0,1];

var yosc2=[5, 1, 1, 1,5];
var yosc3=[25, 0, 3, 4,7];
var yosc4=[0, 0, 3, 0,3];
var yosc5=[37, 0, 0, 1,3];
var yosc6=[7, 1, 0, 3,4];
var yosc7=[15, 2, 0, 6,11];
var yosc8=[3, 0, 0, 0,0];
var yosc9=[2, 0, 1, 0,3];
var yosc12=[0, 1, 0, 2,3];
var yosc13=[0, 1, 1, 0,1];
var yosc14=[0, 0, 0, 0,2];

var qipos2 = [
    [4, 9], [7.5, 11.5], [7, 4.5], [7.5, 9.5], [7, 5], [7, 4.5], [6, 7]
    , [9.2, 9], [7.5, 4], [8, 4], [6, 11], [7.5, 5], [8, 4.5], [10.5, 10]
    , [6, 9], [7.5, 8]
]//詹姆斯
var qipos3 = [
    [4, 9], [10, 4.5]
]//乐福
var qipos4 = [
    [7, 4.5]
]//TT
var qipos5 = [
    [7, 4.5], [8.5, 5.5], [9.4, 4]
]//JR史密斯
var qipos6 = [
    [8, 5], [7.6, 4.8]
]//香波特
var qipos7 = [
    [7.8, 4.5], [7.5, 4.8], [7.3, 5], [6, 6]
]//理查德杰佛森


var qipos1 = [
    [10, 11], [8, 4], [5.5, 4.5], [4.5, 9.5], [9, 9], [6, 9], [9.5, 8]
    , [7, 4.8], [7, 5], [6, 6], [10.7, 9], [9, 11], [6, 7], [8, 5], [9, 6], [9, 8]
    , [4.5, 9.5]
]//欧文
var yopos2 = [
    [5.5, 4], [7, 5]
]//巴恩斯
var yopos3 = [
    [4, 9], [10, 10.5], [7.5, 6], [10.7, 9], [10.3, 10], [10.5, 9.8]
    , [7.8, 4.5], [7.5, 9.5]
]//库里
var yopos4 = [

]//博古特
var yopos5 = [
    [6.5, 9], [4, 9], [4.5, 9.5], [6, 9], [4.8, 9.8], [5.5, 11],
    [6, 11.2], [4, 8], [7, 4.5], [9, 6], [7, 5]
]//汤普森
var yopos6 = [
    [6, 9], [4, 4.5], [10, 4.5]
]//利文斯顿
var yopos7 = [
    [7, 4], [7.5, 4.5], [8, 4.5], [4.5, 9.5], [6, 9]
]//伊戈达拉
var yopos8 = [
    [10.4, 4]
]//巴博莎
var yopos9 = [
    [7.8, 4.8]
]//艾泽里

var yopos12 = [

]//斯贝茨
var yopos13=[];
var yopos14=[];




var dataset1 = [
    { "name": "伊戈达拉", "position": [1, 5], "team": "勇士", "time": "11:24", "score": "2" },
    { "name": "欧文", "position": [10.5, 9], "team": "骑士", "time": "11:08", "score": "3" },
    { "name": "库里", "position": [2.5, 14.5], "team": "勇士", "time": "10:25", "score": "3" },
    { "name": "克莱汤普森", "position": [2.5, 8.5], "team": "勇士", "time": "9:05", "score": "2" },
    { "name": "伊戈达拉", "position": [3.5, 6], "team": "勇士", "time": "8:36", "score": "2" },
    { "name": "欧文", "position": [14, 9], "team": "骑士", "time": "07:57", "score": "2" },
    { "name": "克莱汤普森", "position": [3.5, 12.5], "team": "勇士", "time": "7:43", "score": "3" },
    { "name": "詹姆斯", "position": [10.5, 4], "team": "骑士", "time": "7:27", "score": "3" },
    { "name": "JR史密斯", "position": [11.5, 8.5], "team": "骑士", "time": "6:54", "score": "2" },
    { "name": "库里", "position": [2.5, 1], "team": "勇士", "time": "6:35", "score": "3" },
    { "name": "欧文", "position": [13.5, 4.5], "team": "骑士", "time": "6:06", "score": "2" },
    { "name": "伊戈达拉", "position": [1.1, 5.1], "team": "勇士", "time": "5:45", "score": "2" },
    { "name": "JR史密斯", "position": [13, 9], "team": "骑士", "time": "5:15", "score": "2" },
    { "name": "克莱汤普森", "position": [2.8, 14], "team": "勇士", "time": "4:52", "score": "3" },
    { "name": "JR史密斯", "position": [14, 15], "team": "骑士", "time": "4:35", "score": "3" },
    { "name": "詹姆斯", "position": [10.5, 8.5], "team": "骑士", "time": "4:07", "score": "3" },
    { "name": "巴博莎", "position": [1, 0], "team": "勇士", "time": "3:34", "score": "3" },
    { "name": "詹姆斯", "position": [13.5, 8.5], "team": "骑士", "time": "2:50", "score": "2" },
    { "name": "库里", "position": [3, 6], "team": "勇士", "time": "2:21", "score": "2" },
    { "name": "利文斯顿", "position": [2.4, 10], "team": "勇士", "time": "0:10", "score": "2" },
    { "name": "詹姆斯", "position": [11.5, 8], "team": "骑士", "time": "0:03", "score": "2" }
];

var dataset2 = [
    { "name": "理查德杰佛森", "position": [12, 8], "team": "骑士", "time": "11:45", "score": "2" },
    { "name": "理查德杰佛森", "position": [13.5, 7.5], "team": "骑士", "time": "11:17", "score": "2" },
    { "name": "欧文", "position": [11, 4], "team": "骑士", "time": "10:48", "score": "3" },
    { "name": "克莱汤普森", "position": [2.5, 11], "team": "勇士", "time": "10:29", "score": "2" },
    { "name": "欧文", "position": [12.5, 11], "team": "骑士", "time": "10:13", "score": "2" },
    { "name": "利文斯顿", "position": [1, 8], "team": "勇士", "time": "9:24", "score": "2" },
    { "name": "欧文", "position": [12, 6], "team": "骑士", "time": "9:15", "score": "2" },
    { "name": "克莱汤普森", "position": [3.4, 13], "team": "勇士", "time": "8:22", "score": "3" },
    { "name": "欧文", "position": [13, 12.5], "team": "骑士", "time": "7:35", "score": "2" },
    { "name": "克莱汤普森", "position": [4, 12], "team": "勇士", "time": "7:14", "score": "3" },
    { "name": "詹姆斯", "position": [14, 7], "team": "骑士", "time": "6:51", "score": "2" },
    { "name": "詹姆斯", "position": [14.2, 7.2], "team": "骑士", "time": "6:14", "score": "2" },
    { "name": "克莱汤普森", "position": [4.5, 9], "team": "勇士", "time": "5:47", "score": "3" },
    { "name": "香波特", "position": [13.7, 7.7], "team": "骑士", "time": "5:27", "score": "2" },
    { "name": "詹姆斯", "position": [13, 3], "team": "骑士", "time": "4:52", "score": "2" },
    { "name": "乐福", "position": [12, 12], "team": "骑士", "time": "3:58", "score": "2" },
    { "name": "欧文", "position": [13.7, 6.7], "team": "骑士", "time": "3:45", "score": "2" },
    { "name": "伊戈达拉", "position": [0.8, 7.7], "team": "勇士", "time": "3:28", "score": "2" },
    { "name": "克莱汤普森", "position": [2, 14.5], "team": "勇士", "time": "2:50", "score": "3" },
    { "name": "詹姆斯", "position": [13, 11.5], "team": "骑士", "time": "2:24", "score": "2" },
    { "name": "巴恩斯", "position": [1.4, 15], "team": "勇士", "time": "2:03", "score": "3" },
    { "name": "詹姆斯", "position": [13.5, 8.2], "team": "骑士", "time": "1:46", "score": "2" },
    { "name": "库里", "position": [4, 3], "team": "勇士", "time": "1:32", "score": "3" },
    { "name": "詹姆斯", "position": [11.7, 8.3], "team": "骑士", "time": "1:17", "score": "2" }
];

var dataset3 = [
    { "name": "欧文", "position": [1, 8], "team": "骑士", "time": "11:42", "score": "2" },
    { "name": "库里", "position": [11, 12], "team": "勇士", "time": "11:29", "score": "3" },
    { "name": "詹姆斯", "position": [4.5, 10.5], "team": "骑士", "time": "11:04", "score": "3" },
    { "name": "欧文", "position": [2, 10], "team": "骑士", "time": "9:31", "score": "2" },
    { "name": "詹姆斯", "position": [0.8, 7.7], "team": "骑士", "time": "8:07", "score": "2" },
    { "name": "欧文", "position": [3.8, 3.5], "team": "骑士", "time": "7:45", "score": "3" },
    { "name": "克莱汤普森", "position": [14, 8], "team": "勇士", "time": "7:30", "score": "2" },
    { "name": "詹姆斯", "position": [1.2, 7.3], "team": "骑士", "time": "6:11", "score": "2" },
    { "name": "利文斯顿", "position": [14, 11], "team": "勇士", "time": "5:51", "score": "2" },
    { "name": "欧文", "position": [3.5, 2.5], "team": "骑士", "time": "5:42", "score": "3" },
    { "name": "TT", "position": [0.9, 8.2], "team": "骑士", "time": "5:05", "score": "2" },
    { "name": "理查德杰弗森", "position": [1.5, 7.5], "team": "骑士", "time": "4:15", "score": "2" },
    { "name": "艾泽里", "position": [13.8, 8.3], "team": "勇士", "time": "3:53", "score": "2" },
    { "name": "伊戈达拉", "position": [10.5, 6], "team": "勇士", "time": "3:28", "score": "3" },
    { "name": "詹姆斯", "position": [4, 4], "team": "骑士", "time": "3:04", "score": "3" },
    { "name": "克莱汤普森", "position": [13, 9], "team": "勇士", "time": "2:45", "score": "2" },
    { "name": "理查德杰弗森", "position": [2, 9], "team": "骑士", "time": "1:48", "score": "2" },
    { "name": "巴恩斯", "position": [13.7, 7.7], "team": "勇士", "time": "0:49", "score": "2" }
];


var dataset4 = [
    { "name": "库里", "position": [11, 11], "team": "勇士", "time": "11:40", "score": "3" },
    { "name": "欧文", "position": [2, 11], "team": "骑士", "time": "11:22", "score": "2" },
    { "name": "詹姆斯", "position": [2.8, 12], "team": "骑士", "time": "10:26", "score": "2" },
    { "name": "伊戈达拉", "position": [12, 5], "team": "勇士", "time": "10:08", "score": "2" },
    { "name": "香波特", "position": [1, 7], "team": "骑士", "time": "9:14", "score": "2" },
    { "name": "库里", "position": [14, 8], "team": "勇士", "time": "8:58", "score": "2" },
    { "name": "欧文", "position": [1.5, 7], "team": "骑士", "time": "7:30", "score": "2" },
    { "name": "克莱汤普森", "position": [13.5, 7.5], "team": "勇士", "time": "7:10", "score": "2" },
    { "name": "库里", "position": [11.5, 8], "team": "勇士", "time": "6:39", "score": "2" },
    { "name": "欧文", "position": [1, 6], "team": "骑士", "time": "6:20", "score": "2" },
    { "name": "欧文", "position": [2.5, 6], "team": "骑士", "time": "5:50", "score": "2" },
    { "name": "欧文", "position": [3, 14], "team": "骑士", "time": "5:33", "score": "3" },
    { "name": "詹姆斯", "position": [3, 8], "team": "骑士", "time": "3:22", "score": "2" }
];
var dataset = [];

var time1 = ["11:24", "11:08", "10:25", "9:05", "08:36", "07:57", "07:43", "07:27", "06:54", "06:35", "06:06", "05:45", "05:15", "04:52", "04:35", "04:07", "03:34", "02:50", "02:21", "00:10", "00:03"];

var time2 = ["11:45", "11:17", "10:48", "10:29", "10:13", "09:24", "09:15", "08:22", "07:35", "07:14", "06:51", "06:14", "05:47", "05:27", "04:52", "03:58", "03:45", "03:28", "02:50", "02:24", "02:03", "01:46", "01:32", "01:17"];

var time3 = ["11:42", "11:29", "11:04", "9:31", "8:07", "7:45", "7:30", "6:11", "5:51", "5:42", "5:05", "4:15", "3:53", "3:28", "3:04", "2:45", "1:48", "0:49"];

var time4 = ["11:40", "11:22", "10:26", "10:08", "9:14", "8:58", "7:30", "7:10", "6:39", "6:20", "5:50", "5:33", "3:22"];

var score1=["0-2","3-2","3-5","3-7","3-9","5-9","5-12","8-12","11-12","11-15","13-17","13-19","15-19","16-22","19-22","22-22","22-25","24-25","26-27","27-32","29-32"]
var score2=["31-32","33-32","36-32","36-34","38-34","38-38","40-38","40-41","42-41","42-44","44-44","46-46","46-49","48-49","50-49","52-50","54-50","54-52","54-55","56-55","56-58","58-58","58-61","61-61"]
var score3=["64-61","64-64","67-64","69-66","71-66","74-66","74-68","77-71","77-73","80-73","82-75","85-75","85-77","86-80","89-80","89-82","93-82","93-84"]
var score4=["93-87","95-87","97-88","97-90","99-90","99-92","102-92","102-94","102-96","104-96","106-96","109-96","112-97"]


var qieff=[[2,3,6,4],[3,5,7,9],[4,5,8,10],[5,2,3,7]]
var yoeff=[[10,9,6,8],[9,7,5,3],[8,7,4,2],[7,10,9,5]]



