var qisc1=[10, 3, 0, 1,3];
var qisc2=[19, 4, 1, 9,8];
var qisc3=[5, 1, 0, 0,3];
var qisc4= [8, 1, 0, 0,5];
var qisc5=[5, 2, 0, 2,2];
var qisc6=[3, 0, 0, 0,1];
var qisc7= [12, 1, 1, 0,5];
var qisc8=[0, 0, 1, 0,1];
var qisc9=[7, 0, 0, 2,1] ;
var qisc10=[3, 0, 0, 0,0];
var qisc11=[0, 2, 0, 1,0];
var qisc12=[5, 1, 0, 0,3];
var qisc13= [0, 0, 0, 0,2];


var yosc1=[28, 1, 0, 5,7] ;
var yosc2=[5, 1, 1, 1,5];
var yosc3=[18, 0, 1, 4,9];
var yosc4=[2, 2, 5, 0,6];
var yosc5=[17, 2, 0, 5,2];
var yosc6=[7, 0, 1, 5,2];
var yosc7=[7, 0, 1, 3,5];
var yosc8= [10, 1, 0, 1,3];
var yosc9=[6, 0, 0, 1,2];
var yosc11=[7, 0, 0, 1,3];
var yosc12=[3, 0, 0, 0,0];
var yosc13=[0, 0, 0, 0,2]


var qipos1=[[5.8,12],[9.5,10.5],[7,10],[7,7],[9.5,10.5]];//欧文
var qipos2=[[7.5,7],[7.2,6.6],[8,6.5][8,7.1],[7,7.1],[7,6.2],[4.8,13]];//詹姆斯
var qipos3=[[7.9,7],[10,6]];//乐福
var qipos4=[[7.5,7.2],[7,7],[6.8,6.6]];//汤普森
var qipos5=[[9.8,14],[8,6.9]];//史密斯
var qipos6=[[5,11.5]];//香伯特
var qipos7=[[7.2,6.2],[7.9,6.2],[7.6,7],[7.4,7.3]];//杰弗森
var qipos8=[];//弗莱
var qipos9=[[7,11],[10.4,13]];//德拉维多瓦
var qipos10=[[7.3,7.9]];//邓台-琼斯
var qipos11=[[]];//威廉姆斯
var qipos12=[[7.6,7.5]];//莫兹戈夫
var qipos13=[[]];//詹姆斯-琼斯


var yopos1=[[8,9],[8,6.5],[7.9,6.2],[10.4,12],[10.2,13],[5,13],[8,7],[4.6,12.5],[8,6.2],[7.2,15],[10.3,12]];//格林
var yopos2=[[7,7],[5.8,11.5]];//巴恩斯
var yopos3=[[7.5,15],[8,7],[7.8,12],[10.5,11],[8,7],[4.5,12],[10.6,12]];//库里
var yopos4=[[7,7.5]];//博古特
var yopos5=[[4.6,12],[8,12],[10.8,12.2],[8.5,15],[7.4,6.2],[8.9,14.8]];//克莱-汤普森
var yopos6=[[7.6,7],[6.1,12],[10.5,10.5]];//利文斯顿
var yopos7=[[7,6.5],[7.3,7.5],[7.7,7]];//伊格达拉
var yopos8=[[8,7],[7,7],[7.3,7.1],[7.7,7.1],[7.1,6.5]];//巴博萨
var yopos9=[[7.5,6.5],[7.2,6.2]];//艾泽里
var yopos10=[];//瓦莱乔
var yopos11=[[8,7],[10.5,12],[7,8]];//克拉克
var yopos13=[];//拉什
var yopos12=[[10.3,13]];//斯贝茨

var score1=["2-0","4-0","4-2","6-2","6-4","8-4","8-6","10-6","10-8","10-11","13-11","13-13","13-15","13-17","15-19","17-19","21-19"];
var score2=["21-22","24-22","26-22","28-22","28-25","28-27","28-29","28-31","30-34","30-37","30-39","30-42","33-42","35-42","35-45","35-48","37-50","37-52","39-52","41-52","43-52"];
var score3=["46-52","46-55","46-57","49-57","49-60","51-60","51-62","53-62","53-65","53-69","55-69","57-70","57-74","59-74","59-76","59-79","62-79","62-79","62-82"];
var score4=["62-85","62-87","62-89","62-91","64-91","64-93","64-95","64-97","66-97","68-100","73-100","75-100","75-105","75-108","77-110"];

var dataset1=[
    {"name":"凯里-欧文","position":[11.5,3],"team":"骑士","time":"11:46","score":"2"},
    {"name":"凯里-欧文","position":[12.2,11.9],"team":"骑士","time":"11:09","score":"2"},
    {"name":"德雷蒙德-格林","position":[2.5,5.8],"team":"勇士","time":"9:22","score":"2"},
    {"name":"凯文-乐福","position":[13.3,8],"team":"骑士","time":"9:03","score":"2"},
    {"name":"安德鲁-博古特","position":[1.8,8],"team":"勇士","time":"8:50","score":"2"},

    {"name":"特里斯坦-汤普森","position":[13,8.3],"team":"骑士","time":"8:31","score":"2"},
    {"name": "安德烈-伊格达拉","position":[1.5,8],"team":"勇士","time":"7:34","score":"2"},
    {"name":"特里斯坦-汤普森","position":[13.1,7.7],"team":"骑士","time":"7:06","score":"2"},
    {"name":"德雷蒙德-格林","position":[1.7,7],"team":"勇士","time":"6:39","score":"2"},
    {"name":"斯蒂芬-库里","position":[5,7.5],"team":"勇士","time":"5:29","score":"3"},

    {"name":"J.R.史密斯","position":[10.7,12],"team":"骑士","time":"4:24","score":"3"},
    {"name":"德雷蒙德-格林","position":[1.3,7.2],"team":"勇士","time":"3:58","score":"2"},
    {"name":"费斯图斯-艾泽里","position":[1.5,7.5],"team":"勇士","time":"3:21","score":"2"},
    {"name":"斯蒂芬-库里","position":[1.8,7.2],"team":"勇士","time":"2:57","score":"2"},
    //16
    {"name":"费斯图斯-艾泽里","position":[1.2,7.6],"team":"勇士","time":"2:22","score":"2"},
    {"name":"理查德-杰弗森","position":[13.3,7.8],"team":"骑士","time":"1:55","score":"2"},
    //19
    {"name":"特里斯坦-汤普森","position":[13.3,7.2],"team":"骑士","time":"0:33","score":"2"}
];
var dataset2=[
    {"name":"德雷蒙德-格林","position":[4,3],"team":"勇士","time":"11:43","score":"3"},
    {"name":"伊曼-香伯特","position":[11,3],"team":"骑士","time":"11:16","score":"3"},
    {"name":"勒布朗-詹姆斯","position":[13.5,7.5],"team":"骑士","time":"10:39","score":"2"},
    {"name":"勒布朗-詹姆斯","position":[13.7,7.2],"team":"骑士","time":"10:12","score":"2"},
    {"name":"克莱-汤普森","position":[4.2,12],"team":"勇士","time":"9:57","score":"3"},

    {"name":"肖恩-利文斯顿","position":[1.5,7.5],"team":"勇士","time":"9:37","score":"2"},
    {"name":"哈里森-巴恩斯","position":[1.8,7.8],"team":"勇士","time":"9:01","score":"2"},
    {"name":"克莱-汤普森","position":[3.5,6],"team":"勇士","time":"8:28","score":"2"},
    //10
    {"name":"德雷蒙德-格林","position":[4.2,3.3],"team":"勇士","time":"7:56","score":"3"},
    {"name":"德雷蒙德-格林","position":[4.3,11.8],"team":"勇士","time":"7:28","score":"3"},
    {"name":"斯蒂芬-库里","position":[3.5,6.4],"team":"勇士","time":"5:53","score":"2"},
    {"name":"德雷蒙德-格林","position":[1.5,7.2],"team":"勇士","time":"5:09","score":"3"},
    {"name":"凯文-乐福","position":[13.5,15],"team":"骑士","time":"4:36","score":"3"},
    {"name":"勒布朗-詹姆斯","position":[13.7,7.9],"team":"骑士","time":"4:09","score":"2"},
    //16
    {"name":"斯蒂芬-库里","position":[3.9,2.6],"team":"勇士","time":"3:26","score":"3"},
    {"name":"克莱-汤普森","position":[4.2,2.7],"team":"勇士","time":"3:01","score":"3"},
    //19
    {"name":"斯蒂芬-库里","position":[1.7,7.4],"team":"勇士","time":"2:26","score":"2"},
    {"name":"安德烈-伊格达拉","position":[1.8,7.6],"team":"勇士","time":"2:08","score":"2"},
    {"name":"理查德-杰弗森","position":[13.8,7.7],"team":"骑士","time":"1:48","score":"2"},
    {"name":"勒布朗-詹姆斯","position":[13.4,7.9],"team":"骑士","time":"1:03","score":"2"},
    {"name":"勒布朗-詹姆斯","position":[13.5,7.2],"team":"骑士","time":"0:34","score":"2"}




];
var dataset3=[
    {"name":"凯里-欧文","position":[2.7,7.5],"team":"骑士","time":"10:34","score":"2"},
    {"name":"斯蒂芬-库里","position":[11.1,2.7],"team":"勇士","time":"10:22","score":"3"},
    {"name":"安德烈-伊格达拉","position":[13.5,7.5],"team":"勇士","time":"9:43","score":"2"},
    //5
    {"name":"J.R.史密斯","position":[1.9,7],"team":"骑士","time":"8:30","score":"2"},
    {"name":"德雷蒙德-格林","position":[11,2],"team":"勇士","time":"8:08","score":"3"},
    {"name":"凯里-欧文","position":[1.9,7.6],"team":"骑士","time":"7:43","score":"2"},
    {"name":"莱昂德罗-巴博萨","position":[13.6,7.9],"team":"勇士","time":"7:00","score":"2"},
    {"name":"理查德-杰弗森","position":[2,7.75],"team":"骑士","time":"6:51","score":"2"},
    //10
    {"name":"克莱-汤普森","position":[10.2,9],"team":"勇士","time":"6:28","score":"3"},
    {"name":"莱昂德罗-巴博萨","position":[13.5,7.2],"team":"勇士","time":"5:58","score":"2"},
    {"name":"德雷蒙德-格林","position":[13.7,7.7],"team":"勇士","time":"5:20","score":"2"},
    {"name":"勒布朗-詹姆斯","position":[1.7,7.7],"team":"骑士","time":"4:04","score":"2"},
    //15
    {"name":"理查德-杰弗森","position":[2.2,7.6],"team":"骑士","time":"3:34","score":"2"},
    //17
    {"name":"德雷蒙德-格林","position":[10.4,7],"team":"勇士","time":"2:36","score":"3"},
    {"name":"凯里-欧文","position":[3,3],"team":"骑士","time":"2:18","score":"2"},
    {"name":"德雷蒙德-格林","position":[11.5,9.2],"team":"勇士","time":"1:25","score":"2"},
    //20
    {"name":"克莱-汤普森","position":[13.7,7.3],"team":"勇士","time":"0:59","score":"3"},
    {"name":"勒布朗-詹姆斯","position":[4,12],"team":"骑士","time":"0:34","score":"3"},
    {"name":"克莱-汤普森","position":[10.3,8],"team":"勇士","time":"0:11","score":"3"}
];
var dataset4=[
    {"name":"斯蒂芬-库里","position":[11.1,2.7],"team":"勇士","time":"11:18","score":"3"},
    {"name":"莱昂德罗-巴博萨","position":[13.5,7.3],"team":"勇士","time":"10:24","score":"2"},
    {"name":"莱昂德罗-巴博萨","position":[13.5,6.9],"team":"勇士","time":"10:12","score":"2"},
    {"name":"莱昂德罗-巴博萨","position":[13.7,6.7],"team":"勇士","time":"8:52","score":"2"},
    {"name":"季莫费-莫兹戈夫","position":[1.6,7.5],"team":"骑士","time":"8:28","score":"2"},
    //6
    {"name":"肖恩-利文斯顿","position":[11.5,4.6],"team":"勇士","time":"7:19","score":"2"},
    {"name":"哈里森-巴恩斯","position":[11.7,4.3],"team":"勇士","time":"6:50","score":"2"},
    {"name":"伊恩-克拉克","position":[13.6,7.2],"team":"勇士","time":"6:21","score":"2"},
    {"name":"马修-德拉维多瓦","position":[3.4,7.8],"team":"骑士","time":"6:07","score":"2"},
    //11
    {"name":"肖恩-利文斯顿","position":[12,10],"team":"勇士","time":"5:23","score":"3"},
    //13
    {"name":"马修-德拉维多瓦","position":[4,3],"team":"骑士","time":"4:22","score":"3"},
    {"name":"邓台-琼斯","position":[1.7,7.8],"team":"骑士","time":"2:36","score":"2"},
    //16
    {"name":"马利斯-斯贝茨","position":[10.5,10],"team":"勇士","time":"1:46","score":"3"},
    {"name":"伊恩-克拉克","position":[10.6,10.4],"team":"勇士","time":"1:24","score":"3"},
    //19
    {"name":"伊恩-克拉克","position":[13.1,7.3],"team":"勇士","time":"0:24","score":"2"}


];

var time1=["11:46","11:09","9:22","8:50","8:31","7:34","6:39","5:29","4:24","3:58","3:21","2:57","2:22","1:55","0:33"];
var time2=["11:43","11:16","10:39","10:12","9:57","9:37","9:01","8:28","7:56","7:28","5:53","5:09","4:36","4:09","3:26","3:01","2:26","2:08","1:48","1:03","0:34"];
var time3=["10:34","10:22","9:43","8:30","8:08","7:43","7:00","6:51","6:28","5:58","5:20","4:04","3:34","2:36","2:18","1:25","0:59","0:34","0:11"];
var time4=["11:18","10:24","10:12","8:52","8:28","7:19","6:50","6:21","6:07","5:23","4:22","2:36","1:46","1:24","0:24"];


var qieff=[[4.5,5.1,5.3,3.6],[3.2,4.7,5.8,4.1],[3.6,4.3,5.4,4.4],[4.2,4.7,5.8,5.2]]
var yoeff=[[5.5,4.9,4.7,6.4],[6.8,5.3,4.2,5.9],[6.4,5.7,4.6,5.6],[5.8,5.3,4.2,4.8]]
