var qisc1=[30, 1, 0, 8,4];
var qisc2=[32, 1, 2, 6,11]
var qisc4=[14, 0, 0, 2,13];
var qisc5=[20, 3, 0, 1,4];
var qisc6=[3, 0, 0, 1,5];
var qisc7=[9, 2, 0, 2,8];
var qisc8=[0, 0, 1, 0,0];
var qisc9=[2, 0, 0, 1,1];
var qisc10=[0, 0, 0, 0,1];
var qisc11=[3, 0, 0, 0,2];
var qisc12=[2, 1, 0, 0,2];
var qisc13=[1, 0, 0, 2,0];
var qisc14=[4, 0, 0, 0,1];
var qieff=[[6.4,5.8,6.2,5.5],[5.2,4.6,4.8,5.3],[4.9,4.2,5.8,5.3],[5.1,5.8,6.1,4.8]]
var yoeff=[[3.6,4.2,3.8,4.5],[4.8,5.4,5.2,4.7],[5.1,5.8,4.2,4.7],[4.9,4.2,3.9,5.2]]


var yosc1=[6, 0, 1, 7,7];
var yosc2=[18, 0, 0, 3,8];
var yosc3=[19, 2, 0, 3,1];
var yosc4=[4, 0, 1, 0,2];
var yosc5=[10, 1, 0, 1,2];
var yosc6=[5, 0, 1, 3,6];
var yosc7=[11, 0, 0, 0,2];
var yosc8=[8, 2, 1, 2,0];
var yosc10=[1, 0, 0, 2,2];
var yosc11=[3, 0, 0, 0,0];
var yosc12=[5, 0, 0, 0,1];
var yosc13=[0, 0, 0, 0,1]

var qipos1=[
    [6,11],
    [7.55,6.7],
    [6,13],
    [6.2,13.2],
    [7.65,6.5],
    [6,14.6],
    [7.5,15],
    [4.5,11.7],
    [10.5,5.9],
    [7.65,6.9],
    [7.35,6.6],
];//欧文
var qipos2=[
    [7.35,6.9],
    [7.35,6.3],
    [6.8,8.5],
    [7.6,6.2],
    [7.45,6.9],
    [9.5,12.5],
    [6.5,13],
    [6.7,15],
    [9.7,9.5],
    [7.25,6.6],
    [7.36,6.9],
    [7.6,7.1],
    [7.36,7.1],
    [11.8,8.7],
    [7.65,6.9],
];//詹姆斯
var qipos4=[
    [7.5,6.9],
    [7.1,6.8],
    [7.6,6.7],
    [7.5,7.2],
    [7.3,7.2],
];//特里斯坦 汤普森
var qipos5=[
    [7.3,7.1],
    [10.3,10.5],
    [10.7,5.5],
    [7,11.8],
    [9.1,14.5],
    [3.9,6],
    [10,14.2],
];//JR史密斯
var qipos6=[
    [4,6.1],
];//香珀特
var qipos7=[
    [4,5.5],
    [8.1,6.6],
    [7.5,5.9],
    [7.6,6.7],
];//杰弗森
var qipos8=[[]]//钱宁弗莱
var qipos9=[
    [7,7.3],
];//德拉维多瓦
var qipos10=[[]]//琼斯
var qipos11=[
    [7.5,6.3],
    [9.1,14.3],
];//威廉姆斯
var qipos12=[[]]
var qipos13=[[]]
var qipos14=[
    [7.1,6.9],
    [7.1,6.4],
];//麦克雷

var yopos1=[
    [10.1,10.4],
];//格林
var yopos2=[
    [8,7],
    [8.2,9.2],
    [7.32,6.4],
    [4.5,13.5],
    [9,14.4],
    [7.32,7],
];//巴恩斯
var yopos3=[
    [8.3,7.2],
    [7.3,15],
    [10.9,6.2],
    [7.2,7],
    [10.9,6.9],
    [7.5,8],
];//库里
var yopos4=[
    [7.45,6.9],
    [7.9,9],
];//博古特
var yopos5=[
    [7.35,6.85],
    [7.45,6.2],
    [5,13.5],
    [7.2,6.85],
];//克莱汤普森
var yopos6=[
    [7.55,7],
    [6.3,10.5],
];//利文斯顿
var yopos7=[
    [7.6,6.6],
    [9.2,10.5],
    [7.55,6.4],
    [7.43,7],
    [10.3,12],
];//伊格达拉
var yopos8=[
    [7.45,6.9],
    [9.1,11],
];//巴博萨
var yopos10=[[]]
var yopos11=[
    [5,13.7],
];//克拉克
var yopos12=[[]]
var yopos13=[
    [5.5,14.3],
];//斯贝茨


var dataset1=[
    {"name":"欧文","position":[3,10.3],"team":"骑士","time":"11:01","score":"2"},
    {"name":"詹姆斯","position":[1.4,8],"team":"骑士","time":"10:39","score":"2"},
    {"name":"欧文","position":[1.3,7],"team":"骑士","time":"10:00","score":"2"},
    {"name":"杰弗森","position":[1.1,15],"team":"骑士","time":"9:30","score":"3"},
    {"name":"博古特","position":[13.4,7.5],"team":"勇士","time":"9:12","score":"2"},
    {"name":"博古特","position":[12.5,8.3],"team":"勇士","time":"8:40","score":"2"},
    {"name":"汤普森","position":[1.5,7.5],"team":"骑士","time":"7:41","score":"2"},
    {"name":"詹姆斯","position":[1.2,8],"team":"骑士","time":"6:51","score":"2"},
    {"name":"詹姆斯","position":[1.7,9],"team":"骑士","time":"6:20","score":"2"},
    {"name":"杰弗森","position":[1.25,6],"team":"骑士","time":"5:40","score":"2"},
    {"name":"詹姆斯","position":[1.1,7.2],"team":"骑士","time":"5:02","score":"2"},
    {"name":'格林',"position":[12.3,13],"team":"勇士","time":"4:43","score":"2"},
    {"name":'欧文',"position":[3.6,10.4],"team":"骑士","time":"4:30","score":"2"},
    {"name":'伊戈达拉',"position":[13.6,8],"team":"勇士","time":"4:18","score":"2"},
    {"name":'欧文',"position":[3.7,10.2],"team":"骑士","time":"3:12","score":"2"},
    {"name":'伊戈达拉',"position":[12,11],"team":"勇士","time":"2:45","score":"2"},
    {"name":'欧文',"position":[1.2,6.8],"team":"骑士","time":"2:14","score":"2"},
    {"name":'JR史密斯',"position":[1.6,8],"team":"骑士","time":"1:46","score":"2"},
    {"name":'欧文',"position":[4.4,10.3],"team":"骑士","time":"1:22","score":"3"},
    {"name":'斯贝茨',"position":[10.6,3.2],"team":"勇士","time":"1:06","score":"3"},
    {"name":'欧文',"position":[4.6,7.5],"team":"骑士","time":"0:50","score":"3"},
    {"name":'巴恩斯',"position":[13.4,9],"team":"勇士","time":"0:00","score":"2"}
];
var dataset2=[
    {"name":"巴恩斯","position":[12.5,10],"team":"勇士","time":"10:46","score":"2"},
    {"name":"格林","position":[13.5,8],"team":"勇士","time":"10:20","score":"2"},
    {"name":"巴恩斯","position":[13,8],"team":"勇士","time":"9:45","score":"2+1"},
    {"name":"欧文","position":[3.3,13],"team":"骑士","time":"8:58","score":"3"},
    {"name":"巴博萨","position":[12.2,11.8],"team":"勇士","time":"8:46","score":"2"},
    {"name":"巴恩斯","position":[13.6,7],"team":"勇士","time":"8:27","score":"2"},
    {"name":"汤普森","position":[1.35,8.2],"team":"骑士","time":"7:57","score":"2"},
    {"name":"克莱","position":[13.4,7.2],"team":"勇士","time":"6:34","score":"2"},
    {"name":"伊格达拉","position":[13.7,7.9],"team":"勇士","time":"6:02","score":"2"},
    {"name":"JR史密斯","position":[2.9,13.2],"team":"骑士","time":"4:49","score":"3"},
    {"name":'库里',"position":[13.3,9.1],"team":"勇士","time":"4:05","score":"2"},
    {"name":'詹姆斯',"position":[1.4,7.5],"team":"骑士","time":"3:47","score":"2"},
    {"name":'JR史密斯',"position":[1.2,15],"team":"骑士","time":"3:24","score":"3"},
    {"name":'克莱',"position":[13.8,7.4],"team":"勇士","time":"3:17","score":"2+1"},
    {"name":'克莱',"position":[11,3],"team":"勇士","time":"2:50","score":"3"},
    {"name":'克莱',"position":[13.4,6.8],"team":"勇士","time":"1:51","score":"2"},
    {"name":'汤普森',"position":[1.3,7],"team":"骑士","time":"0:59","score":"2+0"},
    {"name":'利文斯顿',"position":[13.3,7.8],"team":"勇士","time":"0:30","score":"2"}
];
var dataset3=[
    {"name":"欧文","position":[14,14.5],"team":"骑士","time":"11:22","score":"2"},
    {"name":"汤普森","position":[13.1,7.7],"team":"骑士","time":"10:54","score":"2"},
    {"name":"巴恩斯","position":[3.3,13],"team":"勇士","time":"10:22","score":"3"},
    {"name":"JR史密斯","position":[11.6,6],"team":"骑士","time":"9:39","score":"2"},
    {"name":"詹姆斯","position":[11.4,12],"team":"骑士","time":"8:06","score":"2"},
    {"name":"詹姆斯","position":[11.3,5],"team":"骑士","time":"7:10","score":"2"},
    {"name":"伊格达拉","position":[1.5,7.5],"team":"勇士","time":"6:57","score":"2"},
    {"name":"JR史密斯","position":[10.6,11],"team":"骑士","time":"6:34","score":"3"},
    {"name":"詹姆斯","position":[10.4,6],"team":"骑士","time":"5:49","score":"3"},
    {"name":"库里","position":[4.8,8],"team":"勇士","time":"5:32","score":"3"},
    {"name":"詹姆斯","position":[12.3,12.2],"team":"骑士","time":"5:14","score":"2"},
    {"name":'伊格达拉',"position":[3.5,2],"team":"勇士","time":"4:52","score":"3"},
    {"name":'欧文',"position":[13.3,8.2],"team":"骑士","time":"4:06","score":"2"},
    {"name":'库里',"position":[1.2,0],"team":"勇士","time":"3:51","score":"3"},
    {"name":'JR史密斯',"position":[13.6,0],"team":"骑士","time":"3:30","score":"3"},
    {"name":'詹姆斯',"position":[13.4,6.7],"team":"骑士","time":"2:44","score":"2"},
    {"name":'欧文',"position":[13.3,7.2],"team":"骑士","time":"2:23","score":"2"},
    {"name":'库里',"position":[1.45,8.2],"team":"勇士","time":"1:57","score":"2"},
    {"name":'汤普森',"position":[13.1,7],"team":"骑士","time":"1:39","score":"2"},
    {"name":'利文斯顿',"position":[3,10.5],"team":"勇士","time":"1:21","score":"2"},
    {"name":'杰弗森',"position":[13.6,7.5],"team":"骑士","time":"1:02","score":"2"},
    {"name":'库里',"position":[1.4,0],"team":"勇士","time":"0:50","score":"3"},
    {"name":'杰弗森',"position":[13.35,8],"team":"骑士","time":"0:02","score":"2"}
];
var dataset4=[
    {"name":"香珀特","position":[13.5,0],"team":"骑士","time":"10:50","score":"3"},
    {"name":"JR史密斯","position":[11.2,12],"team":"骑士","time":"10:11","score":"3"},
    {"name":"巴恩斯","position":[4,4.5],"team":"勇士","time":"9:45","score":"3"},
    {"name":"詹姆斯","position":[13.1,7.8],"team":"骑士","time":"8:26","score":"2"},
    {"name":"巴博萨","position":[3.1,4.2],"team":"勇士","time":"8:01","score":"2"},
    {"name":"詹姆斯","position":[13.1,7.2],"team":"骑士","time":"7:23","score":"2"},
    {"name":"巴恩斯","position":[1.5,8.1],"team":"勇士","time":"7:09","score":"2"},
    {"name":"詹姆斯","position":[11.5,10.3],"team":"骑士","time":"6:44","score":"2"},
    {"name":"詹姆斯","position":[13.2,8],"team":"骑士","time":"6:11","score":"2"},
    {"name":"库里","position":[2,7.5],"team":"勇士","time":"5:53","score":"2"},
    {"name":'克拉克',"position":[3.3,13],"team":"勇士","time":"5:21","score":"3"},
    {"name":'欧文',"position":[13.3,7],"team":"骑士","time":"5:13","score":"2"},
    {"name":'德拉维多瓦',"position":[12.9,6],"team":"骑士","time":"4:26","score":"2"},
    {"name":'麦克雷',"position":[13.15,6.5],"team":"骑士","time":"2:42","score":"2"},
    {"name":'莫兹戈夫',"position":[13.4,7.7],"team":"骑士","time":"2:03","score":"2"},
    {"name":'麦克雷',"position":[13.35,6.5],"team":"骑士","time":"1:52","score":"2"},
    {"name":'威廉姆斯',"position":[10.6,11],"team":"骑士","time":"1:00","score":"3"}
];
var time1=["11:01","10:39","10:00","9:30","9:12","8:40","7:41","6:51","6:20","5:40","5:02","4:43","4:30","4:18","3:12","2:45","2:14","1:46","1:22","1:06","0:50","0:00"];
var time2=["10:46","10:20","9:45","8:58","8:46","8:27","7:57","6:34","6:02","4:49","4:05","3:47","3:24","3:17","2:50","1:51","0:59","0:30"];
var time3=["11:22","10:54","10:22","9:39","8:06","7:10","6:57","6:34","5:49","5:32","5:14","4:52","4:06","3:51","3:30","2:44","2:23","1:57","1:39","1:21","1:02","0:50","0:02"];
var time4=["10:50","10:11","9:454","8:26","8:01","7:23","7:09","6:44","6:11","5:53","5:21","5:13","4:26","2:42","2:03","1:52","1:00"];

var score1=["0-2","0-4","0-6","0-9","2-9","4-9","4-11","4-13","4-15","4-17","4-19","6-19","6-21","8-21","8-23","10-23","10-25","10-27","10-30","13-30","13-33","16-33"];
var score2=["18-33","20-33","23-33","23-36","25-36","27-36","27-38","29-40","31-40","31-43","33-43","33-45","33-48","36-48","39-48","41-48","41-50","43-51"];
var score3=["43-55","43-57","46-58","46-60","46-62","46-64","48-64","48-67","48-70","51-70","51-72","54-72","56-74","59-74","59-77","59-79","59-81","62-81","62-83","64-83","64-85","68-85","69-89"];
var score4=["69-92","69-95","72-95","73-97","75-97","75-99","77-99","77-101","77-103","80-103","83-105","83-108","83-110","89-113","89-115","89-117","90-120"];

